[
  {
    "picture": "http://placehold.it/300x500", 
      "fileLocation": "http://static2.shop.indiatimes.com/images/products/medium/B3004016/fashion/winter-wear/adidas-black-cotton-men-sweatshirt-x20819.jpg",
    "price": 1999, 
    "id": "545b81", 
    "description": "Aliqua id adipisicing dolor amet amet laborum. Ex tempor ad enim cillum laborum anim elit duis officia do dolore tempor. Esse incididunt reprehenderit enim do quis qui enim elit ut fugiat. Duis cupidatat eu commodo eu sunt eiusmod velit non eu. Irure ad exercitation sint do non pariatur irure commodo eu aute commodo in.\r\n", 
    "title": "cupidatat cupidatat dolore ex ea"
  }, 
  {
    "picture": "http://placehold.it/300x500", 
      "fileLocation": "http://static3.shop.indiatimes.com/images/products/medium/B2831717/fashion/winter-wear/adidas-blue-men-sweatshirt-x23500.jpg",
    "price": 1499, 
    "id": "545b82", 
    "description": "Anim pariatur sint exercitation reprehenderit exercitation qui tempor. Ea sit laboris excepteur Lorem ad esse qui. Sint commodo aliquip veniam consequat tempor non officia sint ut fugiat eiusmod. Voluptate ex consequat adipisicing laboris sunt tempor sunt mollit aliqua.\r\n", 
    "title": "anim nulla irure aliqua velit"
  }, 
  {
    "fileLocation": "http://i03.hsncdn.com/is/image/HomeShoppingNetwork/prodgrid230/apple-iphone-6-plus-128gb-unlocked-gsm-smartphone-d-20150824184154683~1176149_019.jpg",
   "picture": "http://placehold.it/300x500", 
    "price": 40999, 
    "id": "545b8c", 
    "description": "Amet ex nulla anim occaecat excepteur nulla sit incididunt voluptate Lorem dolore irure adipisicing. Ad ad officia esse culpa cupidatat laborum. Incididunt dolor quis fugiat consectetur deserunt voluptate reprehenderit sunt anim incididunt ullamco. Minim minim id nisi consectetur dolore officia exercitation mollit aliquip est ea sint ullamco. Mollit sit fugiat dolor incididunt laboris incididunt. Lorem dolor tempor tempor aute consectetur sunt ex velit pariatur dolor magna sint. Ut irure ipsum nulla deserunt tempor dolore cupidatat occaecat.\r\n", 
    "title": "eiusmod non commodo consequat amet"
  }, 
  {
    "fileLocation": "http://i01.hsncdn.com/is/image/HomeShoppingNetwork/prodgrid230/nokia-lumia-1020-unlocked-gsm-32gb-win-phone-8-phone-d-20160921141923703~1163331_702.jpg",
    "picture": "http://placehold.it/300x500", 
    "price": 9999, 
    "id": "1605619d", 
    "description": "Est et irure elit enim ullamco id labore exercitation consectetur dolore pariatur. Labore ipsum elit commodo veniam pariatur elit laborum culpa in nostrud. Sit culpa sint do culpa in velit magna dolor enim minim. Commodo nostrud cupidatat labore labore sit minim. Reprehenderit enim dolor magna sunt cillum cupidatat. Voluptate nisi duis do id nostrud dolore voluptate ipsum.\r\n", 
    "title": "quis consequat duis dolore cupidatat"
  }, 
  {
    "fileLocation": "http://barelec.me/img/p/7/4/74-home_default.jpg",
   "picture": "http://placehold.it/300x500", 
    "price": 39999, 
    "id": "545b8c1", 
    "description": "Aute ex dolore anim dolore enim culpa laboris amet sit aliqua. Esse occaecat aute minim id est ad deserunt laboris. Sunt adipisicing occaecat eu consequat sunt non.\r\n", 
    "title": "dolor ad sit ex excepteur"
  }, 
  {
    "fileLocation": "http://i02.hsncdn.com/is/image/HomeShoppingNetwork/prodgrid230/lg-nexus-5x-unlocked-gsm-6-core-32gb-android-60-phone-d-2016092210435923~8255572w_388.jpg",
    "picture": "http://placehold.it/300x500", 
    "price": 22599, 
    "id": "545b8c16", 
    "description": "Aute cupidatat non ipsum duis excepteur commodo duis amet laboris minim est laborum dolore irure. Eu nostrud nulla commodo ipsum eiusmod aliqua laboris. Eu sit magna aliquip nisi minim ullamco sint amet commodo veniam aliqua.\r\n", 
    "title": "id dolore exercitation ullamco cupidatat"
  }, 
  {
     "fileLocation": "http://c2c.sulekhalive.com/lcproducts/mobiles/images/htc/htc-desire-320.jpg",
    "picture": "http://placehold.it/300x500",  
    "price": 16999, 
    "id": "545b8c16ae", 
    "description": "Irure eiusmod officia cupidatat cupidatat. Nostrud reprehenderit esse irure sint Lorem aute. Nostrud labore ullamco ex proident laboris minim ut magna incididunt velit fugiat ullamco. Et occaecat labore ea commodo deserunt commodo cupidatat laborum ut ullamco mollit ad excepteur. Cillum laborum commodo culpa adipisicing irure ullamco commodo sit ad quis veniam nulla et. Culpa laborum ad magna sunt magna culpa officia laborum aliqua est ullamco eu nostrud adipisicing.\r\n", 
    "title": "consectetur irure esse anim in"
  }
]